#+title: Contrast ratio values of the Doric themes
#+author: Protesilaos Stavrou (https://protesilaos.com)
#+startup: content indent

Evaluate this snippet. Then update a table by typing =C-c C-c= with
point at the =#+TBLFM:= line.

#+begin_src emacs-lisp :results output silent
;; Copied from my `modus-themes'.

;; This is the WCAG formula to measure relative luminance:
;; <https://www.w3.org/TR/WCAG20-TECHS/G18.html>.
(defun modus-themes--wcag-contribution (channel weight)
  "Return the CHANNEL contribution to overall luminance given WEIGHT."
  (* weight
     (if (<= channel 0.03928)
         (/ channel 12.92)
       (expt (/ (+ channel 0.055) 1.055) 2.4))))

(defun modus-themes-wcag-formula (hex)
  "Get WCAG value of color value HEX.
The value is defined in hexadecimal RGB notation, such #123456."
  (let ((channels (color-name-to-rgb hex))
        (weights '(0.2126 0.7152 0.0722))
        contribution)
    (while channels
      (push (modus-themes--wcag-contribution (pop channels) (pop weights)) contribution))
    (apply #'+ contribution)))

;;;###autoload
(defun modus-themes-contrast (c1 c2)
  "Measure WCAG contrast ratio between C1 and C2.
C1 and C2 are color values written in hexadecimal RGB."
  (let ((ct (/ (+ (modus-themes-wcag-formula c1) 0.05)
               (+ (modus-themes-wcag-formula c2) 0.05))))
    (max ct (/ ct))))

(defalias #'Λ #'modus-themes-contrast)

;; Just an alias for the built-in function that measures distance
;; between colours...
(defalias #'Δ #'color-distance)
#+end_src

* Light themes
:PROPERTIES:
:CUSTOM_ID: h:light-themes
:END:
** Doric Cherry
:PROPERTIES:
:CUSTOM_ID: h:doric-cherry
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #dfd0d9 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #35292f |   12.15 |            10.43 |       9.38 |              5.66 |      9.39 |
| fg-shadow-subtle  | #675462 |    6.07 |             5.21 |       4.69 |              2.83 |      4.69 |
| fg-shadow-intense | #683455 |    8.29 |             7.12 |       6.41 |              3.87 |      6.41 |
| fg-accent         | #77266e |    8.02 |             6.89 |       6.19 |              3.74 |      6.20 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.44 |             8.97 |       8.06 |              4.87 |      8.07 |
| fg-faint-green    | #056100 |    6.75 |             5.80 |       5.21 |              3.15 |      5.22 |
| fg-faint-yellow   | #5f4602 |    7.76 |             6.66 |       5.99 |              3.62 |      6.00 |
| fg-faint-blue     | #353362 |   10.18 |             8.74 |       7.86 |              4.75 |      7.87 |
| fg-faint-magenta  | #553372 |    8.72 |             7.49 |       6.73 |              4.07 |      6.74 |
| fg-faint-cyan     | #35485e |    8.19 |             7.03 |       6.32 |              3.82 |      6.33 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #dfd0d9 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #f7edf1 |       0 |             2591 |       6292 |             43766 |      5533 |
| bg-shadow-subtle  | #e5dde0 |    2591 |                0 |        890 |             26336 |      1695 |
| bg-neutral        | #dfd0d9 |    6292 |              890 |          0 |             17584 |      1022 |
| bg-shadow-intense | #cc95b7 |   43766 |            26336 |      17584 |                 0 |     19021 |
| bg-accent         | #edcae5 |    5533 |             1695 |       1022 |             19021 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Earth
:PROPERTIES:
:CUSTOM_ID: h:doric-earth
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d7d3c2 |           #c09fa0 |   #e7d5b9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #30232e |   12.72 |            11.09 |       9.95 |              6.20 |     10.40 |
| fg-shadow-subtle  | #635650 |    6.01 |             5.23 |       4.70 |              2.92 |      4.91 |
| fg-shadow-intense | #58383f |    8.71 |             7.59 |       6.81 |              4.24 |      7.12 |
| fg-accent         | #74321f |    8.06 |             7.02 |       6.30 |              3.93 |      6.59 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.18 |             8.87 |       7.96 |              4.96 |      8.32 |
| fg-faint-green    | #056100 |    6.58 |             5.74 |       5.15 |              3.21 |      5.38 |
| fg-faint-yellow   | #5f4602 |    7.57 |             6.59 |       5.92 |              3.68 |      6.18 |
| fg-faint-blue     | #353362 |    9.93 |             8.65 |       7.76 |              4.83 |      8.11 |
| fg-faint-magenta  | #553372 |    8.51 |             7.41 |       6.65 |              4.14 |      6.95 |
| fg-faint-cyan     | #35485e |    7.98 |             6.96 |       6.24 |              3.89 |      6.53 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d7d3c2 |           #c09fa0 |   #e7d5b9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #f0eddf |       0 |             2246 |       6333 |             39749 |      5582 |
| bg-shadow-subtle  | #dfdfce |    2246 |                0 |       1075 |             23899 |      1527 |
| bg-neutral        | #d7d3c2 |    6333 |             1075 |          0 |             14957 |       931 |
| bg-shadow-intense | #c09fa0 |   39749 |            23899 |      14957 |                 0 |     17459 |
| bg-accent         | #e7d5b9 |    5582 |             1527 |        931 |             17459 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Light
:PROPERTIES:
:CUSTOM_ID: h:doric-light
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #e1e4e5 |           #a0bcd0 |   #d8f1f3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000000 |   21.00 |            18.30 |      16.43 |             10.60 |     17.80 |
| fg-shadow-subtle  | #455058 |    8.26 |             7.20 |       6.47 |              4.17 |      7.00 |
| fg-shadow-intense | #213067 |   12.48 |            10.87 |       9.76 |              6.30 |     10.57 |
| fg-accent         | #084092 |    9.73 |             8.48 |       7.61 |              4.91 |      8.24 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   11.96 |            10.42 |       9.35 |              6.03 |     10.13 |
| fg-faint-green    | #056100 |    7.73 |             6.74 |       6.05 |              3.90 |      6.55 |
| fg-faint-yellow   | #5f4602 |    8.89 |             7.74 |       6.95 |              4.48 |      7.53 |
| fg-faint-blue     | #353362 |   11.66 |            10.16 |       9.12 |              5.88 |      9.88 |
| fg-faint-magenta  | #553372 |    9.99 |             8.70 |       7.81 |              5.04 |      8.46 |
| fg-faint-cyan     | #35485e |    9.38 |             8.17 |       7.34 |              4.73 |      7.94 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #e1e4e5 |           #a0bcd0 |   #d8f1f3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #ffffff |       0 |             2143 |       7009 |             48556 |      5572 |
| bg-shadow-subtle  | #efeff2 |    2143 |                0 |       1418 |             30569 |      1560 |
| bg-neutral        | #e1e4e5 |    7009 |             1418 |          0 |             19178 |      1336 |
| bg-shadow-intense | #a0bcd0 |   48556 |            30569 |      19178 |                 0 |     22768 |
| bg-accent         | #d8f1f3 |    5572 |             1560 |       1336 |             22768 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Marble
:PROPERTIES:
:CUSTOM_ID: h:doric-marble
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #d5d5d5 |           #b0b0b0 |   #e5d7c5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #202020 |   13.92 |            12.23 |      11.10 |              7.51 |     11.53 |
| fg-shadow-subtle  | #595959 |    5.98 |             5.26 |       4.77 |              3.23 |      4.96 |
| fg-shadow-intense | #404040 |    8.86 |             7.78 |       7.06 |              4.78 |      7.34 |
| fg-accent         | #603d3a |    8.06 |             7.08 |       6.43 |              4.35 |      6.67 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.21 |             8.97 |       8.15 |              5.51 |      8.46 |
| fg-faint-green    | #056100 |    6.60 |             5.80 |       5.27 |              3.56 |      5.47 |
| fg-faint-yellow   | #5f4602 |    7.59 |             6.67 |       6.05 |              4.10 |      6.29 |
| fg-faint-blue     | #353362 |    9.96 |             8.75 |       7.94 |              5.38 |      8.25 |
| fg-faint-magenta  | #553372 |    8.53 |             7.49 |       6.80 |              4.60 |      7.07 |
| fg-faint-cyan     | #35485e |    8.01 |             7.04 |       6.39 |              4.32 |      6.63 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #d5d5d5 |           #b0b0b0 |   #e5d7c5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #ededed |       0 |             1777 |       5224 |             33751 |      5503 |
| bg-shadow-subtle  | #dfdfdf |    1777 |                0 |        907 |             20036 |      1802 |
| bg-neutral        | #d5d5d5 |    5224 |              907 |          0 |             12417 |      1306 |
| bg-shadow-intense | #b0b0b0 |   33751 |            20036 |      12417 |                 0 |     15022 |
| bg-accent         | #e5d7c5 |    5503 |             1802 |       1306 |             15022 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Wind
:PROPERTIES:
:CUSTOM_ID: h:doric-wind
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e8f0e9 |          #d8e4df |    #ced9db |           #94c2bf |   #c9e0ba |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000f0f |   16.81 |            14.96 |      13.55 |              9.98 |     13.82 |
| fg-shadow-subtle  | #4c4f52 |    7.09 |             6.31 |       5.72 |              4.21 |      5.83 |
| fg-shadow-intense | #104038 |    9.97 |             8.87 |       8.04 |              5.92 |      8.20 |
| fg-accent         | #3f5900 |    6.84 |             6.09 |       5.52 |              4.06 |      5.63 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.29 |             9.16 |       8.30 |              6.11 |      8.46 |
| fg-faint-green    | #006500 |    6.65 |             5.92 |       5.36 |              3.95 |      5.47 |
| fg-faint-yellow   | #5f4602 |    7.65 |             6.80 |       6.17 |              4.54 |      6.29 |
| fg-faint-blue     | #353362 |   10.03 |             8.93 |       8.09 |              5.96 |      8.25 |
| fg-faint-magenta  | #553372 |    8.59 |             7.65 |       6.93 |              5.10 |      7.06 |
| fg-faint-cyan     | #35485e |    8.07 |             7.18 |       6.51 |              4.79 |      6.63 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e8f0e9 |          #d8e4df |    #ced9db |           #94c2bf |   #c9e0ba |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #e8f0e9 |       0 |             1536 |       4503 |             32059 |      8580 |
| bg-shadow-subtle  | #d8e4df |    1536 |                0 |        807 |             19666 |      3714 |
| bg-neutral        | #ced9db |    4503 |              807 |          0 |             13088 |      2684 |
| bg-shadow-intense | #94c2bf |   32059 |            19666 |      13088 |                 0 |     11285 |
| bg-accent         | #c7e2c1 |    7387 |             2818 |       1967 |             11163 |       136 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

* Dark themes
:PROPERTIES:
:CUSTOM_ID: h:dark-themes
:END:
** Doric Dark
:PROPERTIES:
:CUSTOM_ID: h:doric-dark
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #3c3843 |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #ffffff |   21.00 |            13.35 |      11.42 |              8.49 |     12.97 |
| fg-shadow-subtle  | #a2a0b2 |    8.21 |             5.22 |       4.46 |              3.32 |      5.07 |
| fg-shadow-intense | #cfcff8 |   13.93 |             8.86 |       7.58 |              5.63 |      8.61 |
| fg-accent         | #cda4df |    9.97 |             6.34 |       5.42 |              4.03 |      6.16 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    9.70 |             6.17 |       5.28 |              3.92 |      5.99 |
| fg-faint-green    | #85c397 |   10.25 |             6.52 |       5.57 |              4.14 |      6.33 |
| fg-faint-yellow   | #c4a992 |    9.44 |             6.00 |       5.13 |              3.81 |      5.83 |
| fg-faint-blue     | #95afd2 |    9.34 |             5.94 |       5.08 |              3.77 |      5.77 |
| fg-faint-magenta  | #c5a3b2 |    9.26 |             5.88 |       5.03 |              3.74 |      5.72 |
| fg-faint-cyan     | #a5bfce |   10.94 |             6.96 |       5.95 |              4.42 |      6.76 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #3c3843 |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #000000 |       0 |            22833 |      33365 |             78768 |     29991 |
| bg-shadow-subtle  | #332d38 |   22833 |                0 |       1008 |             17981 |      3273 |
| bg-neutral        | #3c3843 |   33365 |             1008 |          0 |             11385 |      3861 |
| bg-shadow-intense | #50447f |   78768 |            17981 |      11385 |                 0 |     16560 |
| bg-accent         | #521e40 |   29991 |             3273 |       3861 |             16560 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Fire
:PROPERTIES:
:CUSTOM_ID: h:doric-fire
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a281d |          #40332f |    #493c37 |           #601a2f |   #52402f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #f0e5e0 |   11.97 |             9.81 |       8.56 |             10.08 |      7.96 |
| fg-shadow-subtle  | #afa497 |    6.04 |             4.95 |       4.32 |              5.09 |      4.02 |
| fg-shadow-intense | #e2b0a4 |    7.73 |             6.34 |       5.53 |              6.51 |      5.15 |
| fg-accent         | #e6a577 |    7.05 |             5.78 |       5.04 |              5.94 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #d09090 |    5.69 |             4.66 |       4.07 |              4.79 |      3.78 |
| fg-faint-green    | #85c397 |    7.22 |             5.92 |       5.16 |              6.08 |      4.81 |
| fg-faint-yellow   | #c4a992 |    6.65 |             5.45 |       4.75 |              5.60 |      4.42 |
| fg-faint-blue     | #95afd2 |    6.58 |             5.39 |       4.71 |              5.54 |      4.38 |
| fg-faint-magenta  | #c5a3b2 |    6.52 |             5.34 |       4.66 |              5.49 |      4.34 |
| fg-faint-cyan     | #a5bfce |    7.71 |             6.32 |       5.51 |              6.49 |      5.13 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a281d |          #40332f |    #493c37 |           #601a2f |   #52402f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #2a281d |       0 |             2476 |       5658 |              8354 |      6839 |
| bg-shadow-subtle  | #40332f |    2476 |                0 |        687 |              4907 |      1427 |
| bg-neutral        | #493c37 |    5658 |              687 |          0 |              6075 |       426 |
| bg-shadow-intense | #601a2f |    8354 |             4907 |       6075 |                 0 |      6285 |
| bg-accent         | #52402f |    6839 |             1427 |        426 |              6285 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Obsidian
:PROPERTIES:
:CUSTOM_ID: h:doric-obsidian
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #432f2a |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e7e7e7 |   14.36 |            10.83 |       9.20 |              6.52 |     10.12 |
| fg-shadow-subtle  | #969696 |    6.00 |             4.53 |       3.85 |              2.73 |      4.23 |
| fg-shadow-intense | #b0b0b0 |    8.19 |             6.17 |       5.24 |              3.72 |      5.77 |
| fg-accent         | #b59487 |    6.38 |             4.81 |       4.09 |              2.90 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    8.20 |             6.19 |       5.25 |              3.73 |      5.78 |
| fg-faint-green    | #85c397 |    8.67 |             6.53 |       5.55 |              3.94 |      6.11 |
| fg-faint-yellow   | #c4a992 |    7.98 |             6.02 |       5.11 |              3.62 |      5.62 |
| fg-faint-blue     | #95afd2 |    7.90 |             5.95 |       5.06 |              3.59 |      5.56 |
| fg-faint-magenta  | #c5a3b2 |    7.83 |             5.90 |       5.01 |              3.55 |      5.51 |
| fg-faint-cyan     | #a5bfce |    9.25 |             6.98 |       5.93 |              4.20 |      6.52 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #432f2a |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #181818 |       0 |             4798 |      10485 |             28444 |      7113 |
| bg-shadow-subtle  | #2f2f2f |    4798 |                0 |       1097 |              9877 |       966 |
| bg-neutral        | #3a3a3a |   10485 |             1097 |          0 |              4390 |      1381 |
| bg-shadow-intense | #505050 |   28444 |             9877 |       4390 |                 0 |      8726 |
| bg-accent         | #432f2a |    7113 |              966 |       1381 |              8726 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Plum
:PROPERTIES:
:CUSTOM_ID: h:doric-plum
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #302f3c |    #423b53 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e2d7e7 |   12.14 |             9.46 |       7.62 |              6.13 |      9.46 |
| fg-shadow-subtle  | #a694b1 |    6.02 |             4.69 |       3.78 |              3.04 |      4.69 |
| fg-shadow-intense | #cea6d0 |    8.03 |             6.25 |       5.04 |              4.05 |      6.26 |
| fg-accent         | #c586ba |    6.02 |             4.69 |       3.78 |              3.04 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    7.79 |             6.07 |       4.89 |              3.93 |      6.08 |
| fg-faint-green    | #85c397 |    8.23 |             6.42 |       5.17 |              4.16 |      6.42 |
| fg-faint-yellow   | #c4a992 |    7.58 |             5.91 |       4.76 |              3.83 |      5.91 |
| fg-faint-blue     | #95afd2 |    7.50 |             5.85 |       4.71 |              3.79 |      5.85 |
| fg-faint-magenta  | #c5a3b2 |    7.44 |             5.79 |       4.67 |              3.75 |      5.80 |
| fg-faint-cyan     | #a5bfce |    8.79 |             6.85 |       5.52 |              4.44 |      6.86 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #302f3c |    #423b53 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #221832 |       0 |             2845 |      10282 |             25593 |      5289 |
| bg-shadow-subtle  | #302f3c |    2845 |                0 |       2786 |             13581 |      3499 |
| bg-neutral        | #423b53 |   10282 |             2786 |          0 |              4250 |      5048 |
| bg-shadow-intense | #5e4170 |   25593 |            13581 |       4250 |                 0 |     12099 |
| bg-accent         | #501e3e |    5289 |             3499 |       5048 |             12099 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Water
:PROPERTIES:
:CUSTOM_ID: h:doric-water
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #34384c |    #3e4053 |           #405290 |   #523e48 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #edf0f8 |   12.54 |            10.14 |       8.93 |              6.51 |      8.60 |
| fg-shadow-subtle  | #aea6b8 |    6.09 |             4.93 |       4.34 |              3.16 |      4.18 |
| fg-shadow-intense | #b8c2e0 |    8.05 |             6.51 |       5.73 |              4.18 |      5.52 |
| fg-accent         | #c2a0a0 |    6.01 |             4.86 |       4.28 |              3.12 |      4.12 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    6.60 |             5.34 |       4.70 |              3.43 |      4.53 |
| fg-faint-green    | #85c397 |    6.98 |             5.64 |       4.97 |              3.63 |      4.79 |
| fg-faint-yellow   | #c4a992 |    6.42 |             5.20 |       4.57 |              3.34 |      4.41 |
| fg-faint-blue     | #95afd2 |    6.36 |             5.14 |       4.53 |              3.30 |      4.36 |
| fg-faint-magenta  | #c5a3b2 |    6.30 |             5.10 |       4.49 |              3.27 |      4.32 |
| fg-faint-cyan     | #a5bfce |    7.45 |             6.03 |       5.30 |              3.87 |      5.11 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #34384c |    #3e4053 |           #405290 |   #523e48 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #2a283d |       0 |             1890 |       4574 |             27573 |      5904 |
| bg-shadow-subtle  | #34384c |    1890 |                0 |        619 |             15968 |      2241 |
| bg-neutral        | #3e4053 |    4574 |              619 |          0 |             11639 |      1267 |
| bg-shadow-intense | #405290 |   27573 |            15968 |      11639 |                 0 |     16537 |
| bg-accent         | #523e48 |    5904 |             2241 |       1267 |             16537 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)
